RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
/**
 *******************************************************************************
 * @file  hc32f4a0_clk.c
 * @brief This file provides firmware functions to manage the Clock(CLK).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-07-03       Zhangxl         1. Tpyo
                                    2. API CLK_SetSysClkSrc() refine
   2020-08-19       Zhangxl         1. Modify formula of PLL clock get API
                                    2. Zero structure for CLK_PLLxStrucInit()
   2020-08-25       Zhangxl         Modify for MISRAC2012-10.1, 10.3
   2020-10-13       Chengy          Add VBAT init at head of CLK_Xtal32Init()
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_clk.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CLK CLK
 * @brief Clock Driver Library
 * @{
 */

#if (DDL_CLK_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CLK_Local_Macros CLK Local Macros
 * @brief Be able to modify TIMEOUT according to board condition.
 * @{
 */
#define CLK_XTAL_TIMEOUT                    ((uint32_t)0x1000UL)
#define CLK_XTAL32_TIMEOUT                  ((uint32_t)0x1000UL)
#define CLK_HRC_TIMEOUT                     ((uint32_t)0x1000UL)
#define CLK_MRC_TIMEOUT                     ((uint32_t)0x1000UL)
#define CLK_LRC_TIMEOUT                     ((uint32_t)0x1000UL)
#define CLK_PLLH_TIMEOUT                    ((uint32_t)0x1000UL)
#define CLK_PLLA_TIMEOUT                    ((uint32_t)0x1000UL)

/**
 * @defgroup CLK_Check_Parameters_Validity CLK Check Parameters Validity
 * @{
 */

/* Check CLK register lock status. */
#define IS_CLK_UNLOCKED()       ((M4_PWC->FPRC & PWC_FPRC_FPRCB0) == PWC_FPRC_FPRCB0)

/* Check CLK register lock status. */
#define IS_CLK_SEL_UNLOCKED()   ((M4_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1)

/*! Parameter valid check for XTAL state */
#define IS_CLK_XTAL_STATE(sta)                                                  \
(   ((sta) == CLK_XTAL_OFF)                         ||                          \
    ((sta) == CLK_XTAL_ON))

/*! Parameter valid check for XTAL mode */
#define IS_CLK_XTAL_MODE(MODE)                                                  \
(   ((MODE) == CLK_XTALMODE_OSC)                    ||                          \
    ((MODE) == CLK_XTALMODE_EXCLK))

/*! Parameter valid check for XTAL driver ability mode */
#define IS_CLK_XTALDRV_MODE(drv)                                                \
(   ((drv) == CLK_XTALDRV_HIGH)                     ||                          \
    ((drv) == CLK_XTALDRV_MID)                      ||                          \
    ((drv) == CLK_XTALDRV_LOW)                      ||                          \
    ((drv) == CLK_XTALDRV_ULOW))

/*! Parameter valid check for XTAL stable time selection */
#define IS_CLK_XTALSTB_SEL(stb)                                                 \
(   ((stb) == CLK_XTALSTB_133US)                    ||                          \
    ((stb) == CLK_XTALSTB_255US)                    ||                          \
    ((stb) == CLK_XTALSTB_499US)                    ||                          \
    ((stb) == CLK_XTALSTB_988US)                    ||                          \
    ((stb) == CLK_XTALSTB_2MS)                      ||                          \
    ((stb) == CLK_XTALSTB_4MS)                      ||                          \
    ((stb) == CLK_XTALSTB_8MS)                      ||                          \
    ((stb) == CLK_XTALSTB_16MS)                     ||                          \
    ((stb) == CLK_XTALSTB_31MS))

/*! Parameter valid check for XTALSTD state */
#define IS_CLK_XTALSTD_STATE(sta)                                               \
(   ((sta) == CLK_XTALSTD_OFF)                      ||                          \
    ((sta) == CLK_XTALSTD_ON))

/*! Parameter valid check for XTALSTD mode */
#define IS_CLK_XTALSTD_MODE(mode)                                               \
(   ((mode) == CLK_XTALSTD_MODE_RST)                ||                          \
    ((mode) == CLK_XTALSTD_MODE_INT))

/*! Parameter valid check for XTALSTD interrupt state */
#define IS_CLK_XTALSTD_INT_STATE(sta)                                           \
(   ((sta) == CLK_XTALSTD_INT_OFF)                  ||                          \
    ((sta) == CLK_XTALSTD_INT_ON))

/*! Parameter valid check for XTALSTD reset state */
#define IS_CLK_XTALSTD_RST_STATE(sta)                                           \
(   ((sta) == CLK_XTALSTD_RST_OFF)                  ||                          \
    ((sta) == CLK_XTALSTD_RST_ON))

/*! Parameter valid check for PLLA state */
#define IS_CLK_PLLA_STATE(sta)                                                  \
(   ((sta) == CLK_PLLA_OFF)                         ||                          \
    ((sta) == CLK_PLLA_ON))

/*! Parameter valid check for PLLH state */
#define IS_CLK_PLLH_STATE(sta)                                                  \
(   ((sta) == CLK_PLLH_OFF)                         ||                          \
    ((sta) == CLK_PLLH_ON))

/*! Parameter valid check for XTAL32 state */
#define IS_CLK_XTAL32_STATE(sta)                                                \
(   ((sta) == CLK_XTAL32_OFF)                       ||                          \
    ((sta) == CLK_XTAL32_ON))

/*! Parameter valid check for XTAL32 driver ability mode */
#define IS_CLK_XTAL32DRV_MODE(mode)                                             \
(   ((mode) == CLK_XTAL32DRV_MID)                   ||                          \
    ((mode) == CLK_XTAL32DRV_HIGH))

/*! Parameter valid check for XTAL32 filtering selection */
#define IS_CLK_XTAL32_FILT_SEL(sel)                                             \
(   ((sel) == CLK_XTAL32NF_FULL)                    ||                          \
    ((sel) == CLK_XTAL32NF_PART)                    ||                          \
    ((sel) == CLK_XTAL32NF_NONE))

/*! Parameter valid check for system clock source */
#define IS_CLK_SYSCLK_SRC(src)                                                  \
(   ((src) == CLK_SYSCLKSOURCE_HRC)                 ||                          \
    ((src) == CLK_SYSCLKSOURCE_MRC)                 ||                          \
    ((src) == CLK_SYSCLKSOURCE_LRC)                 ||                          \
    ((src) == CLK_SYSCLKSOURCE_XTAL)                ||                          \
    ((src) == CLK_SYSCLKSOURCE_XTAL32)              ||                          \
    ((src) == CLK_SYSCLKSOURCE_PLLH))

/*! Parameter validity check for PLL input source */
#define IS_CLK_PLL_SRC(src)                                                     \
(   ((src) == CLK_PLLSRC_XTAL)                      ||                          \
    ((src) == CLK_PLLSRC_HRC))

/*! Parameter validity check for PLLH frequency range */
#define IS_CLK_PLLH_FREQ(freq)                                                  \
(   (CLK_PLLH_FREQ_MIN <= (freq))                   &&                          \
    (CLK_PLLH_FREQ_MAX >= (freq)))

/*! Parameter validity check for PLLH M divide */
#define IS_CLK_PLLHM_DIV(m)                                                     \
(   (CLK_PLLHM_DIV_MIN <= (m))                      &&                          \
    (CLK_PLLHM_DIV_MAX >= (m)))

/*! Parameter validity check for PLLH N multi- */
#define IS_CLK_PLLHN_MULTI(n)                                                   \
(   (CLK_PLLHN_MULTI_MIN <= (n))                    &&                          \
    (CLK_PLLHN_MULTI_MAX >= (n)))

/*! Parameter validity check for PLLH R divide */
#define IS_CLK_PLLHR_DIV(r)                                                     \
(   (CLK_PLLHR_DIV_MIN <= (r))                      &&                          \
    (CLK_PLLHR_DIV_MAX >= (r)))

