RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
/*! Parameter validity check for PLLH Q divede */
#define IS_CLK_PLLHQ_DIV(q)                                                     \
(   (CLK_PLLHQ_DIV_MIN <= (q))                      &&                          \
    (CLK_PLLHQ_DIV_MAX >= (q)))

/*! Parameter validity check for PLLH P divide */
#define IS_CLK_PLLHP_DIV(p)                                                     \
(   (CLK_PLLHP_DIV_MIN <= (p))                      &&                          \
    (CLK_PLLHP_DIV_MAX >= (p)))

/*! Parameter validity check for PLLH_input freq./PLLM(vco_in) */
#define IS_CLK_PLLH_VCO_IN(vco_in)                                              \
(   (CLK_PLLH_VCO_IN_MIN <= (vco_in))               &&                          \
    (CLK_PLLH_VCO_IN_MAX >= (vco_in)))

/*! Parameter validity check for PLLH vco_in*PLLN(vco_out) */
#define IS_CLK_PLLH_VCO_OUT(vco_out)                                            \
(   (CLK_PLLH_VCO_OUT_MIN <= (vco_out))             &&                          \
    (CLK_PLLH_VCO_OUT_MAX >= (vco_out)))

/*! Parameter validity check for PLLA frequency range */
#define IS_CLK_PLLA_FREQ(freq)                                                  \
(   (CLK_PLLA_FREQ_MIN <= (freq))                   &&                          \
    (CLK_PLLA_FREQ_MAX >= (freq)))

/*! Parameter validity check for PLLA M divide */
#define IS_CLK_PLLAM_DIV(m)                                                     \
(   (CLK_PLLAM_DIV_MIN <= (m))                      &&                          \
    (CLK_PLLAM_DIV_MAX >= (m)))

/*! Parameter validity check for PLLA N multi- */
#define IS_CLK_PLLAN_MULTI(n)                                                   \
(   (CLK_PLLAN_MULTI_MIN <= (n))                    &&                          \
    (CLK_PLLAN_MULTI_MAX >= (n)))

/*! Parameter validity check for PLLA R divide */
#define IS_CLK_PLLAR_DIV(r)                                                     \
(   (CLK_PLLAR_DIV_MIN <= (r))                      &&                          \
    (CLK_PLLAR_DIV_MAX >= (r)))

/*! Parameter validity check for PLLA Q divede */
#define IS_CLK_PLLAQ_DIV(q)                                                     \
(   (CLK_PLLAQ_DIV_MIN <= (q))                      &&                          \
    (CLK_PLLAQ_DIV_MAX >= (q)))

/*! Parameter validity check for PLLA P divide */
#define IS_CLK_PLLAP_DIV(p)                                                     \
(   (CLK_PLLAP_DIV_MIN <= (p))                      &&                          \
    (CLK_PLLAP_DIV_MAX >= (p)))

/*! Parameter validity check for PLLA_input freq./PLLM(vco_in) */
#define IS_CLK_PLLA_VCO_IN(vco_in)                                              \
(   (CLK_PLLA_VCO_IN_MIN <= (vco_in))               &&                          \
    (CLK_PLLA_VCO_IN_MAX >= (vco_in)))

/*! Parameter validity check for PLLA vco_in*PLLN(vco_out) */
#define IS_CLK_PLLA_VCO_OUT(vco_out)                                            \
(   (CLK_PLLA_VCO_OUT_MIN <= (vco_out))             &&                          \
    (CLK_PLLA_VCO_OUT_MAX >= (vco_out)))

/*! Parameter valid check for CLK stable flag. */
#define IS_CLK_STB_FLAG(flag)                                                   \
(   ((flag) != 0x00U)                               &&                          \
    (((flag) | CLK_STB_FLAG_MASK) == CLK_STB_FLAG_MASK))

/*! Parameter valid check for clock category */
#define IS_CLK_CATE(cate)       (((cate) & CLK_CATE_ALL) != (uint8_t)(0x00U))

/*! Parameter valid check for HCLK divider */
#define IS_CLK_HCLK_DIV(div)                                                    \
(   ((div) == CLK_HCLK_DIV1)                        ||                          \
    ((div) == CLK_HCLK_DIV2)                        ||                          \
    ((div) == CLK_HCLK_DIV4)                        ||                          \
    ((div) == CLK_HCLK_DIV8)                        ||                          \
    ((div) == CLK_HCLK_DIV16)                       ||                          \
    ((div) == CLK_HCLK_DIV32)                       ||                          \
    ((div) == CLK_HCLK_DIV64))

/*! Parameter valid check for EXCLK divider */
#define IS_CLK_EXCLK_DIV(div)                                                   \
(   ((div) == CLK_EXCLK_DIV1)                       ||                          \
    ((div) == CLK_EXCLK_DIV2)                       ||                          \
    ((div) == CLK_EXCLK_DIV4)                       ||                          \
    ((div) == CLK_EXCLK_DIV8)                       ||                          \
    ((div) == CLK_EXCLK_DIV16)                      ||                          \
    ((div) == CLK_EXCLK_DIV32)                      ||                          \
    ((div) == CLK_EXCLK_DIV64))

/*! Parameter valid check for PCLK0 divider */
#define IS_CLK_PCLK0_DIV(div)                                                   \
(   ((div) == CLK_PCLK0_DIV1)                       ||                          \
    ((div) == CLK_PCLK0_DIV2)                       ||                          \
    ((div) == CLK_PCLK0_DIV4)                       ||                          \
    ((div) == CLK_PCLK0_DIV8)                       ||                          \
    ((div) == CLK_PCLK0_DIV16)                      ||                          \
    ((div) == CLK_PCLK0_DIV32)                      ||                          \
    ((div) == CLK_PCLK0_DIV64))

/*! Parameter valid check for PCLK1 divider */
#define IS_CLK_PCLK1_DIV(div)                                                   \
(   ((div) == CLK_PCLK1_DIV1)                       ||                          \
    ((div) == CLK_PCLK1_DIV2)                       ||                          \
    ((div) == CLK_PCLK1_DIV4)                       ||                          \
    ((div) == CLK_PCLK1_DIV8)                       ||                          \
    ((div) == CLK_PCLK1_DIV16)                      ||                          \
    ((div) == CLK_PCLK1_DIV32)                      ||                          \
    ((div) == CLK_PCLK1_DIV64))

/*! Parameter valid check for PCLK2 divider */
#define IS_CLK_PCLK2_DIV(div)                                                   \
(   ((div) == CLK_PCLK2_DIV1)                       ||                          \
    ((div) == CLK_PCLK2_DIV2)                       ||                          \
    ((div) == CLK_PCLK2_DIV4)                       ||                          \
    ((div) == CLK_PCLK2_DIV8)                       ||                          \
    ((div) == CLK_PCLK2_DIV16)                      ||                          \
    ((div) == CLK_PCLK2_DIV32)                      ||                          \
    ((div) == CLK_PCLK2_DIV64))

/*! Parameter valid check for PCLK3 divider */
#define IS_CLK_PCLK3_DIV(div)                                                   \
(   ((div) == CLK_PCLK3_DIV1)                       ||                          \
    ((div) == CLK_PCLK3_DIV2)                       ||                          \
    ((div) == CLK_PCLK3_DIV4)                       ||                          \
    ((div) == CLK_PCLK3_DIV8)                       ||                          \
    ((div) == CLK_PCLK3_DIV16)                      ||                          \
    ((div) == CLK_PCLK3_DIV32)                      ||                          \
    ((div) == CLK_PCLK3_DIV64))

/*! Parameter valid check for PCLK4 divider */
#define IS_CLK_PCLK4_DIV(div)                                                   \
(   ((div) == CLK_PCLK4_DIV1)                       ||                          \
    ((div) == CLK_PCLK4_DIV2)                       ||                          \
    ((div) == CLK_PCLK4_DIV4)                       ||                          \
    ((div) == CLK_PCLK4_DIV8)                       ||                          \
    ((div) == CLK_PCLK4_DIV16)                      ||                          \
    ((div) == CLK_PCLK4_DIV32)                      ||                          \
    ((div) == CLK_PCLK4_DIV64))

/*! Parameter valid check for USB clock source */
#define IS_CLK_USB_CLK(src)                                                     \
(   ((src) == CLK_USB_CLK_MCLK_DIV2)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV3)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV4)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV5)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV6)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV7)                ||                          \
    ((src) == CLK_USB_CLK_MCLK_DIV8)                ||                          \
    ((src) == CLK_USB_CLK_PLLHQ)                    ||                          \
    ((src) == CLK_USB_CLK_PLLHR)                    ||                          \
    ((src) == CLK_USB_CLK_PLLAP)                    ||                          \
    ((src) == CLK_USB_CLK_PLLAQ)                    ||                          \
    ((src) == CLK_USB_CLK_PLLAR))

/*! Parameter valid check for CAN clock source */
#define IS_CLK_CAN_CLK(src)                                                     \
(   ((src) == CLK_CAN1_CLK_MCLK_DIV2)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV3)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV4)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV5)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV6)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV7)               ||                          \
    ((src) == CLK_CAN1_CLK_MCLK_DIV8)               ||                          \
    ((src) == CLK_CAN1_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_CAN1_CLK_PLLHR)                   ||                          \
    ((src) == CLK_CAN1_CLK_PLLAP)                   ||                          \
    ((src) == CLK_CAN1_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_CAN1_CLK_PLLAR)                   ||                          \
    ((src) == CLK_CAN1_CLK_XTAL)                    ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV2)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV3)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV4)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV5)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV6)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV7)               ||                          \
    ((src) == CLK_CAN2_CLK_MCLK_DIV8)               ||                          \
    ((src) == CLK_CAN2_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_CAN2_CLK_PLLHR)                   ||                          \
    ((src) == CLK_CAN2_CLK_PLLAP)                   ||                          \
    ((src) == CLK_CAN2_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_CAN2_CLK_PLLAR)                   ||                          \
    ((src) == CLK_CAN2_CLK_XTAL))

/*! Parameter valid check for CAN channel for clock source config */
#define IS_CLK_CAN_CH(ch)       (((ch) & CLK_CAN_CH_ALL) != (uint8_t)(0x00U))

