RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
/*! Parameter valid check for I2S clock source */
#define IS_CLK_I2S_CLK(src)                                                     \
(   ((src) == CLK_I2S1_CLK_PCLK)                    ||                          \
    ((src) == CLK_I2S1_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_I2S1_CLK_PLLHR)                   ||                          \
    ((src) == CLK_I2S1_CLK_PLLAP)                   ||                          \
    ((src) == CLK_I2S1_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_I2S1_CLK_PLLAR)                   ||                          \
    ((src) == CLK_I2S2_CLK_PCLK)                    ||                          \
    ((src) == CLK_I2S2_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_I2S2_CLK_PLLHR)                   ||                          \
    ((src) == CLK_I2S2_CLK_PLLAP)                   ||                          \
    ((src) == CLK_I2S2_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_I2S2_CLK_PLLAR)                   ||                          \
    ((src) == CLK_I2S3_CLK_PCLK)                    ||                          \
    ((src) == CLK_I2S3_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_I2S3_CLK_PLLHR)                   ||                          \
    ((src) == CLK_I2S3_CLK_PLLAP)                   ||                          \
    ((src) == CLK_I2S3_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_I2S3_CLK_PLLAR)                   ||                          \
    ((src) == CLK_I2S4_CLK_PCLK)                    ||                          \
    ((src) == CLK_I2S4_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_I2S4_CLK_PLLHR)                   ||                          \
    ((src) == CLK_I2S4_CLK_PLLAP)                   ||                          \
    ((src) == CLK_I2S4_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_I2S4_CLK_PLLAR))

/*! Parameter valid check for I2S channel for clock source config */
#define IS_CLK_I2S_CH(ch)       (((ch) & CLK_I2S_CH_ALL) != (uint8_t)(0x00U))

/*! Parameter valid check for PCLK2/PCLK4 source */
#define IS_CLK_PERI_CLK(src)                                                    \
(   ((src) == CLK_PERI_CLK_PCLK)                    ||                          \
    ((src) == CLK_PERI_CLK_PLLHQ)                   ||                          \
    ((src) == CLK_PERI_CLK_PLLHR)                   ||                          \
    ((src) == CLK_PERI_CLK_PLLAP)                   ||                          \
    ((src) == CLK_PERI_CLK_PLLAQ)                   ||                          \
    ((src) == CLK_PERI_CLK_PLLAR))

/*! Parameter valid check for TPIU clock divider */
#define IS_CLK_TPIU_CLK_DIV(div)                                                \
(   ((div) == CLK_TPIU_CLK_DIV1)                    ||                          \
    ((div) == CLK_TPIU_CLK_DIV2)                    ||                          \
    ((div) == CLK_TPIU_CLK_DIV4))

/*! Parameter valid check for CLK MCO clock source. */
#define IS_CLK_MCOSOURCE(src)                                                   \
(   ((src) == CLK_MCOSOURCCE_HRC)                   ||                          \
    ((src) == CLK_MCOSOURCCE_MRC)                   ||                          \
    ((src) == CLK_MCOSOURCCE_LRC)                   ||                          \
    ((src) == CLK_MCOSOURCCE_XTAL)                  ||                          \
    ((src) == CLK_MCOSOURCCE_XTAL32)                ||                          \
    ((src) == CLK_MCOSOURCCE_PLLHP)                 ||                          \
    ((src) == CLK_MCOSOURCCE_PLLHQ)                 ||                          \
    ((src) == CLK_MCOSOURCCE_PLLAP)                 ||                          \
    ((src) == CLK_MCOSOURCCE_PLLAQ)                 ||                          \
    ((src) == CLK_MCOSOURCCE_PLLAR)                 ||                          \
    ((src) == CLK_MCOSOURCCE_SYSCLK))

/*! Parameter valid check for CLK MCO clock divider. */
#define IS_CLK_MCODIV(div)                                                      \
(   ((div) == CLK_MCO_DIV1)                         ||                          \
    ((div) == CLK_MCO_DIV2)                         ||                          \
    ((div) == CLK_MCO_DIV4)                         ||                          \
    ((div) == CLK_MCO_DIV8)                         ||                          \
    ((div) == CLK_MCO_DIV16)                        ||                          \
    ((div) == CLK_MCO_DIV32)                        ||                          \
    ((div) == CLK_MCO_DIV64)                        ||                          \
    ((div) == CLK_MCO_DIV128))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Functions CLK Global Functions
 * @{
 */
/**
 * @brief  Set PLLH/A source clock.
 * @param  [in] u32PllSrc PLLH/A source clock.
 *   @arg  CLK_PLLSRC_XTAL
 *   @arg  CLK_PLLSRC_HRC
 * @retval None
 */
void CLK_SetPLLSrc(uint32_t u32PllSrc)
{
    DDL_ASSERT(IS_CLK_PLL_SRC(u32PllSrc));
    DDL_ASSERT(IS_CLK_UNLOCKED());

