RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
    WRITE_REG32(bM4_CMU->PLLHCFGR_b.PLLSRC, u32PllSrc);
}

/**
 * @brief  Init PLLA initial structure with default value.
 * @param  [in] pstcPLLAInit specifies the Parameter of PLLA.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: NULL pointer
 */
en_result_t CLK_PLLAStrucInit(stc_clk_plla_init_t* pstcPLLAInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcPLLAInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcPLLAInit->PLLCFGR        = 0UL;
        pstcPLLAInit->u8PLLState     = CLK_PLLA_OFF;
        pstcPLLAInit->PLLCFGR_f.PLLP = CLK_PLLAP_DFT;
        pstcPLLAInit->PLLCFGR_f.PLLQ = CLK_PLLAQ_DFT;
        pstcPLLAInit->PLLCFGR_f.PLLR = CLK_PLLAR_DFT;
        pstcPLLAInit->PLLCFGR_f.PLLN = CLK_PLLAN_DFT;
        pstcPLLAInit->PLLCFGR_f.PLLM = CLK_PLLAM_DFT;
    }
    return enRet;
}

/**
 * @brief  PLLA Initialize.
 * @param  [in] pstcPLLAInit specifies the structure of PLLA initial config.
 *   @arg  u8PLLState  : The new state of the PLLA.
 *   @arg  PLLCFGR     : PLLA config.
 * @retval en_result_t
 *         OK, PLLA initial successfully
 *         ErrorTimeout, PLLA initial timeout
 *         ErrorInvalidParameter, NULL pointer
 * @note   The pll_input/PLLM (VCOIN) must between 1 ~ 24MHz.
 *         The VCOIN*PLLN (VCOOUT) is between 240 ~ 480MHz.
 *         The PLLA frequency (VCOOUT/PLLAP_Q_R) is between 15 ~ 240MHz.
 */
en_result_t CLK_PLLAInit(const stc_clk_plla_init_t *pstcPLLAInit)
{
    en_result_t enRet;

#ifdef __DEBUG
    uint32_t vcoIn;
    uint32_t vcoOut;
#endif

    if (NULL == pstcPLLAInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
#ifdef __DEBUG
        DDL_ASSERT(IS_CLK_PLLAM_DIV(pstcPLLAInit->PLLCFGR_f.PLLM + 1UL));
        DDL_ASSERT(IS_CLK_PLLAN_MULTI(pstcPLLAInit->PLLCFGR_f.PLLN + 1UL));
        DDL_ASSERT(IS_CLK_PLLAR_DIV(pstcPLLAInit->PLLCFGR_f.PLLR + 1UL));
        DDL_ASSERT(IS_CLK_PLLAQ_DIV(pstcPLLAInit->PLLCFGR_f.PLLQ + 1UL));
        DDL_ASSERT(IS_CLK_PLLAP_DIV(pstcPLLAInit->PLLCFGR_f.PLLP + 1UL));

        vcoIn = ((CLK_PLLSRC_XTAL == bM4_CMU->PLLHCFGR_b.PLLSRC ?
                    XTAL_VALUE : HRC_VALUE) / (pstcPLLAInit->PLLCFGR_f.PLLM + 1UL));
        vcoOut = vcoIn * (pstcPLLAInit->PLLCFGR_f.PLLN + 1UL);

        DDL_ASSERT(IS_CLK_PLLA_VCO_IN(vcoIn));
        DDL_ASSERT(IS_CLK_PLLA_VCO_OUT(vcoOut));
        DDL_ASSERT(IS_CLK_PLLA_FREQ(vcoOut/(pstcPLLAInit->PLLCFGR_f.PLLR + 1UL)));
        DDL_ASSERT(IS_CLK_PLLA_FREQ(vcoOut/(pstcPLLAInit->PLLCFGR_f.PLLQ + 1UL)));
        DDL_ASSERT(IS_CLK_PLLA_FREQ(vcoOut/(pstcPLLAInit->PLLCFGR_f.PLLP + 1UL)));
#endif
        DDL_ASSERT(IS_CLK_PLLA_STATE(pstcPLLAInit->u8PLLState));
        DDL_ASSERT(IS_CLK_UNLOCKED());

        WRITE_REG32(M4_CMU->PLLACFGR, pstcPLLAInit->PLLCFGR);

        if (CLK_PLLA_ON == pstcPLLAInit->u8PLLState)
        {
            enRet = CLK_PLLACmd(Enable);
        }
        else
        {
            enRet = CLK_PLLACmd(Disable);
        }
    }
    return enRet;
}

/**
 * @brief  Init PLLH initial structure with default value.
 * @param  [in] pstcPLLHInit specifies the Parameter of PLLH.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: NULL pointer
 */
en_result_t CLK_PLLHStrucInit(stc_clk_pllh_init_t* pstcPLLHInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcPLLHInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcPLLHInit->PLLCFGR          = 0UL;
        pstcPLLHInit->u8PLLState       = CLK_PLLH_OFF;
        pstcPLLHInit->PLLCFGR_f.PLLP   = CLK_PLLHP_DFT;
        pstcPLLHInit->PLLCFGR_f.PLLQ   = CLK_PLLHQ_DFT;
        pstcPLLHInit->PLLCFGR_f.PLLR   = CLK_PLLHR_DFT;
        pstcPLLHInit->PLLCFGR_f.PLLN   = CLK_PLLHN_DFT;
        pstcPLLHInit->PLLCFGR_f.PLLM   = CLK_PLLHM_DFT;
        pstcPLLHInit->PLLCFGR_f.PLLSRC = CLK_PLLSRC_XTAL;
    }
    return enRet;
}

/**
 * @brief  PLLH initialize.
 * @param  [in] pstcPLLHInit specifies the structure of PLLH initial config.
 *   @arg  u8PLLState  : The new state of the PLLH.
 *   @arg  PLLCFGR     : PLLH config.
 * @retval en_result_t
 *         OK, PLLH initial successfully
 *         ErrorTimeout, PLLH initial timeout
 *         ErrorNotReady, PLLH is the source clock, CANNOT stop it.
 *         ErrorInvalidParameter, NULL pointer
 * @note   The pll_input/PLLM (VCOIN) must between 8 ~ 24MHz.
 *         The VCOIN*PLLN (VCOOUT) is between 600 ~ 1200MHz.
 *         The PLLH frequency (VCOOUT/PLLHP_Q_R) is between 40 ~ 240MHz.
 */
en_result_t CLK_PLLHInit(const stc_clk_pllh_init_t *pstcPLLHInit)
{
    en_result_t enRet;

#ifdef __DEBUG
    uint32_t vcoIn;
    uint32_t vcoOut;
#endif

    if (NULL == pstcPLLHInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
#ifdef __DEBUG
        DDL_ASSERT(IS_CLK_PLLHM_DIV(pstcPLLHInit->PLLCFGR_f.PLLM + 1UL));
        DDL_ASSERT(IS_CLK_PLLHN_MULTI(pstcPLLHInit->PLLCFGR_f.PLLN + 1UL));
        DDL_ASSERT(IS_CLK_PLLHR_DIV(pstcPLLHInit->PLLCFGR_f.PLLR + 1UL));
        DDL_ASSERT(IS_CLK_PLLHQ_DIV(pstcPLLHInit->PLLCFGR_f.PLLQ + 1UL));
        DDL_ASSERT(IS_CLK_PLLHP_DIV(pstcPLLHInit->PLLCFGR_f.PLLP + 1UL));
        DDL_ASSERT(IS_CLK_PLL_SRC(pstcPLLHInit->PLLCFGR_f.PLLSRC));

        vcoIn = ((CLK_PLLSRC_XTAL == pstcPLLHInit->PLLCFGR_f.PLLSRC ?
                    XTAL_VALUE : HRC_VALUE) / (pstcPLLHInit->PLLCFGR_f.PLLM + 1UL));
        vcoOut = vcoIn * (pstcPLLHInit->PLLCFGR_f.PLLN + 1UL);

        DDL_ASSERT(IS_CLK_PLLH_VCO_IN(vcoIn));
        DDL_ASSERT(IS_CLK_PLLH_VCO_OUT(vcoOut));
        DDL_ASSERT(IS_CLK_PLLH_FREQ(vcoOut/(pstcPLLHInit->PLLCFGR_f.PLLR + 1UL)));
        DDL_ASSERT(IS_CLK_PLLH_FREQ(vcoOut/(pstcPLLHInit->PLLCFGR_f.PLLQ + 1UL)));
        DDL_ASSERT(IS_CLK_PLLH_FREQ(vcoOut/(pstcPLLHInit->PLLCFGR_f.PLLP + 1UL)));
#endif
        DDL_ASSERT(IS_CLK_PLLH_STATE(pstcPLLHInit->u8PLLState));
        DDL_ASSERT(IS_CLK_UNLOCKED());

