RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
        /* set PLL source in advance */
        WRITE_REG32(bM4_CMU->PLLHCFGR_b.PLLSRC, pstcPLLHInit->PLLCFGR_f.PLLSRC);
        WRITE_REG32(M4_CMU->PLLHCFGR, pstcPLLHInit->PLLCFGR);

        if (CLK_PLLH_ON == pstcPLLHInit->u8PLLState)
        {
            enRet = CLK_PLLHCmd(Enable);
        }
        else
        {
            enRet = CLK_PLLHCmd(Disable);
        }
    }

    return enRet;
}

/**
 * @brief  Init Xtal initial structure with default value.
 * @param  [in] pstcXtalInit specifies the Parameter of XTAL.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: NULL pointer
 */
en_result_t CLK_XtalStrucInit(stc_clk_xtal_init_t* pstcXtalInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtalInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtalInit->u8XtalState   = CLK_XTAL_OFF;
        pstcXtalInit->u8XtalMode    = CLK_XTALMODE_OSC;
        pstcXtalInit->u8XtalDrv     = CLK_XTALDRV_HIGH;
        pstcXtalInit->u8XtalStb     = CLK_XTALSTB_2MS;
    }

    return enRet;
}

/**
 * @brief  XTAL initialize.
 * @param  [in] pstcXtalInit specifies the XTAL initial config.
 *   @arg  u8XtalState  : The new state of the XTAL.
 *   @arg  u8XtalDrv    : The XTAL drive ability.
 *   @arg  u8XtalMode   : The XTAL mode selection osc or exclk.
 *   @arg  u8XtalStb    : The XTAL stable time selection.
 * @retval en_result_t
 *         OK, XTAL intial successfully.
 *         ErrorTimeout, XTAL operate timeout.
 *         ErrorNotReady, XTAL is the system clock, CANNOT stop it.
 *         ErrorInvalidParameter, NULL pointer.
 * @note   DO NOT STOP XTAL while using it as system clock.
 */
en_result_t CLK_XtalInit(const stc_clk_xtal_init_t *pstcXtalInit)
{
    en_result_t enRet;

    if (NULL == pstcXtalInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_CLK_XTAL_STATE(pstcXtalInit->u8XtalState));
        DDL_ASSERT(IS_CLK_XTALDRV_MODE(pstcXtalInit->u8XtalDrv));
        DDL_ASSERT(IS_CLK_XTAL_MODE(pstcXtalInit->u8XtalMode));
        DDL_ASSERT(IS_CLK_XTALSTB_SEL(pstcXtalInit->u8XtalStb));
        DDL_ASSERT(IS_CLK_UNLOCKED());

        WRITE_REG8(M4_CMU->XTALSTBCR, pstcXtalInit->u8XtalStb);
        WRITE_REG8(M4_CMU->XTALCFGR, (0x80U | pstcXtalInit->u8XtalDrv | pstcXtalInit->u8XtalMode));

        if (CLK_XTAL_ON == pstcXtalInit->u8XtalState)
        {
            enRet = CLK_XtalCmd(Enable);
        }
        else
        {
            enRet = CLK_XtalCmd(Disable);
        }
    }

    return enRet;
}

/**
 * @brief  Init Xtal32 initial structure with default value.
 * @param  [in] pstcXtal32Init specifies the Parameter of XTAL32.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: NULL pointer
 */
en_result_t CLK_Xtal32StrucInit(stc_clk_xtal32_init_t* pstcXtal32Init)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtal32Init)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtal32Init->u8Xtal32State   = CLK_XTAL32_OFF;
        pstcXtal32Init->u8Xtal32Drv     = CLK_XTAL32DRV_MID;
        pstcXtal32Init->u8Xtal32NF      = CLK_XTAL32NF_FULL;
    }

    return enRet;
}

/**
 * @brief  XTAL32 initialize.
 * @param  [in] pstcXtal32Init specifies the XTAL32 initial config.
 *   @arg  u8Xtal32State  : The new state of the XTAL32.
 *   @arg  u8Xtal32Drv    : The XTAL32 drive capacity.
 *   @arg  u8Xtal32NF     : The XTAL32 nosie filter on or off.
 * @retval en_result_t
 *         OK, XTAL32 intial successfully.
 *         ErrorNotReady, XTAL32 is the system clock, CANNOT stop it.
 *         ErrorInvalidParameter, NULL pointer.
 * @note   DO NOT STOP XTAL32 while using it as system clock.
 */
en_result_t CLK_Xtal32Init(const stc_clk_xtal32_init_t *pstcXtal32Init)
{
    en_result_t enRet;

    if (NULL == pstcXtal32Init)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameters check */
        DDL_ASSERT(IS_CLK_XTAL32DRV_MODE(pstcXtal32Init->u8Xtal32Drv));
        DDL_ASSERT(IS_CLK_XTAL32_FILT_SEL(pstcXtal32Init->u8Xtal32NF));
        DDL_ASSERT(IS_CLK_UNLOCKED());
        DDL_ASSERT(IS_CLK_SEL_UNLOCKED());

        WRITE_REG8(M4_PWC->VBATRSTR, 0xA5U);
        WRITE_REG8(M4_CMU->XTAL32CFGR, pstcXtal32Init->u8Xtal32Drv);
        WRITE_REG8(M4_CMU->XTAL32NFR, pstcXtal32Init->u8Xtal32NF);

        if (CLK_XTAL32_ON == pstcXtal32Init->u8Xtal32State)
        {
            enRet = CLK_Xtal32Cmd(Enable);
        }
        else
        {
            enRet = CLK_Xtal32Cmd(Disable);
        }
    }

    return enRet;
}

/**
 * @brief  XTAL function enable/disbale.
 * @param  [in] enNewState specifies the new state of XTAL.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, XTAL operate successfully
 *         ErrorNotReady, XTAL is the system clock or as the PLL source clock,
 *                        CANNOT stop it.
 *         ErrorTimeout, XTAL operate timeout.
 * @note   DO NOT STOP XTAL while using it as system clock or as the PLL source clock.
 */
en_result_t CLK_XtalCmd(en_functional_state_t enNewState)
{

    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_XTAL == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        /* XTAL as PLL clock source and PLL is working */
        else if (0UL == bM4_CMU->PLLHCFGR_b.PLLSRC)
        {
           if (0UL == bM4_CMU->PLLHCR_b.PLLHOFF)
           {
                enRet = ErrorNotReady;
           }
           else
           {
                WRITE_REG32(bM4_CMU->XTALCR_b.XTALSTP, CLK_XTAL_OFF);
           }
        }
        else
        {
            WRITE_REG32(bM4_CMU->XTALCR_b.XTALSTP, CLK_XTAL_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->XTALCR_b.XTALSTP, CLK_XTAL_ON);

        enRet = ErrorTimeout;
        while (timeout <= CLK_XTAL_TIMEOUT)
        {
            if (Set == CLK_GetStableStatus(CMU_OSCSTBSR_XTALSTBF))
            {
                enRet = Ok;
                break;
            }
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  XTAL32 function enable/disbale.
 * @param  [in] enNewState specifies the new state of XTAL32.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, XTAL32 operate successfully
 *         ErrorNotReady, XTAL32 is the system clock, CANNOT stop it.
 * @note   DO NOT STOP XTAL32 while using it as system clock.
 */
en_result_t CLK_Xtal32Cmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_XTAL32 == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        else
        {
            WRITE_REG32(bM4_CMU->XTAL32CR_b.XTAL32STP, CLK_XTAL32_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->XTAL32CR_b.XTAL32STP, CLK_XTAL32_ON);

        while (timeout <= CLK_XTAL32_TIMEOUT)
        {
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  HRC function enable/disbale.
 * @param  [in] enNewState specifies the new state of HRC.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, HRC operate successfully
 *         ErrorNotReady, HRC is the system clock or as the PLL source clock,
 *                        CANNOT stop it.
 *         ErrorTimeout, HRC operate timeout
 * @note   DO NOT STOP HRC while using it as system clock or as the PLL source clock.
 */
en_result_t CLK_HrcCmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_HRC == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        /* HRC as PLL clock source and PLL is working */
        else if (1UL == bM4_CMU->PLLHCFGR_b.PLLSRC)
        {
            if (0UL == bM4_CMU->PLLHCR_b.PLLHOFF)
            {
                enRet = ErrorNotReady;
            }
            else
            {
                WRITE_REG32(bM4_CMU->HRCCR_b.HRCSTP, CLK_HRC_OFF);
            }
        }
        else
        {
            WRITE_REG32(bM4_CMU->HRCCR_b.HRCSTP, CLK_HRC_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->HRCCR_b.HRCSTP, CLK_HRC_ON);

        enRet = ErrorTimeout;
        while (timeout <= CLK_HRC_TIMEOUT)
        {
            if (Set == CLK_GetStableStatus(CMU_OSCSTBSR_HRCSTBF))
            {
                enRet = Ok;
                break;
            }
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  MRC function enable/disbale.
 * @param  [in] enNewState specifies the new state of MRC.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, MRC operate successfully
 *         ErrorNotReady, MRC is the system clock, CANNOT stop it.
 * @note   DO NOT STOP MRC while using it as system clock.
 */
en_result_t CLK_MrcCmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_MRC == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        else
        {
            WRITE_REG32(bM4_CMU->MRCCR_b.MRCSTP, CLK_MRC_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->MRCCR_b.MRCSTP, CLK_MRC_ON);

        while (timeout <= CLK_MRC_TIMEOUT)
        {
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  LRC function enable/disbale.
 * @param  [in] enNewState specifies the new state of LRC.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, LRC operate successfully
 *         ErrorNotReady, LRC is the system clock, CANNOT stop it.
 * @note   DO NOT STOP LRC while using it as system clock.
 */
en_result_t CLK_LrcCmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_LRC == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        else
        {
            WRITE_REG32(bM4_CMU->LRCCR_b.LRCSTP, CLK_LRC_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->LRCCR_b.LRCSTP, CLK_LRC_ON);

