RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
        while (timeout <= CLK_LRC_TIMEOUT)
        {
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  PLLA function enable/disbale.
 * @param  [in] enNewState specifies the new state of PLLA.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, PLLA operate successfully
 *         ErrorTimeout, PLLA operate timeout
 * @note
 */
en_result_t CLK_PLLACmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        WRITE_REG32(bM4_CMU->PLLACR_b.PLLAOFF, CLK_PLLA_OFF);
    }
    else
    {
        WRITE_REG32(bM4_CMU->PLLACR_b.PLLAOFF, CLK_PLLA_ON);

        enRet = ErrorTimeout;
        while (timeout <= CLK_PLLA_TIMEOUT)
        {
            if (Set == CLK_GetStableStatus(CMU_OSCSTBSR_PLLASTBF))
            {
                enRet = Ok;
                break;
            }
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  PLLH function enable/disbale.
 * @param  [in] enNewState specifies the new state of PLLH.
 *   @arg  Enable
 *   @arg  Disable
 * @retval en_result_t
 *         OK, PLLH operate successfully
 *         ErrorNotReady, PLLH is the system clock, CANNOT stop it.
 *         ErrorTimeout, PLLH operate timeout
 * @note   DO NOT STOP PLLH while using it as system clock.
 */
en_result_t CLK_PLLHCmd(en_functional_state_t enNewState)
{
    en_result_t enRet = Ok;
    __IO uint32_t timeout = 0UL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (Disable == enNewState)
    {
        if (CLK_SYSCLKSOURCE_PLLH == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = ErrorNotReady;
        }
        else
        {
            WRITE_REG32(bM4_CMU->PLLHCR_b.PLLHOFF, CLK_PLLH_OFF);
        }
    }
    else
    {
        WRITE_REG32(bM4_CMU->PLLHCR_b.PLLHOFF, CLK_PLLH_ON);

        enRet = ErrorTimeout;
        while (timeout <= CLK_PLLH_TIMEOUT)
        {
            if (Set == CLK_GetStableStatus(CMU_OSCSTBSR_PLLHSTBF))
            {
                enRet = Ok;
                break;
            }
            timeout++;
        }
    }

    return enRet;
}

/**
 * @brief  Init XtalStd initial structure with default value.
 * @param  [in] pstcXtalStdInit specifies the Parameter of XTALSTD.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStdStrucInit(stc_clk_xtalstd_init_t* pstcXtalStdInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtalStdInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtalStdInit->u8XtalStdState = CLK_XTALSTD_OFF;
        pstcXtalStdInit->u8XtalStdMode  = CLK_XTALSTD_MODE_INT;
        pstcXtalStdInit->u8XtalStdInt   = CLK_XTALSTD_RST_OFF;
        pstcXtalStdInit->u8XtalStdRst   = CLK_XTALSTD_INT_OFF;
    }

    return enRet;
}

/**
 * @brief  Initialise the XTAL status detection.
 * @param  [in] pstcXtalStdInit specifies the Parameter of XTALSTD.
 *   @arg  u8XtalStdState: The new state of the XTALSTD.
 *   @arg  u8XtalStdMode:  The XTAL status detection occur interrupt or reset.
 *   @arg  u8XtalStdInt:   The XTAL status detection interrupt on or off.
 *   @arg  u8XtalStdRst:   The XTAL status detection reset on or off.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStdInit(const stc_clk_xtalstd_init_t* pstcXtalStdInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcXtalStdInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter valid check */
        DDL_ASSERT(IS_CLK_XTALSTD_STATE(pstcXtalStdInit->u8XtalStdState));
        DDL_ASSERT(IS_CLK_UNLOCKED());

        if(CLK_XTALSTD_OFF == pstcXtalStdInit->u8XtalStdState)
        {
            /* Disbale XTAL status detection */
            WRITE_REG32(bM4_CMU->XTALSTDCR_b.XTALSTDE, (uint32_t)CLK_XTALSTD_OFF);
        }
        else
        {
            /* Parameter valid check */
            DDL_ASSERT(IS_CLK_XTALSTD_MODE(pstcXtalStdInit->u8XtalStdMode));
            DDL_ASSERT(IS_CLK_XTALSTD_INT_STATE(pstcXtalStdInit->u8XtalStdInt));
            DDL_ASSERT(IS_CLK_XTALSTD_RST_STATE(pstcXtalStdInit->u8XtalStdRst));

            /* Configure and enable XTALSTD */
            WRITE_REG8(M4_CMU->XTALSTDCR, (pstcXtalStdInit->u8XtalStdState |   \
                                           pstcXtalStdInit->u8XtalStdMode  |   \
                                           pstcXtalStdInit->u8XtalStdInt   |   \
                                           pstcXtalStdInit->u8XtalStdRst));
        }
    }

    return enRet;
}

/**
 * @brief  Clear the XTAL error flag.
 * @param  None
 * @retval None
 * @note   The system clock should not be XTAL before call this function.
 */
void CLK_ClearXtalStdStatus(void)
{
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if(1UL == READ_REG32(bM4_CMU->XTALSTDSR_b.XTALSTDF))
    {
        /* Clear the XTAL STD flag */
        WRITE_REG32(bM4_CMU->XTALSTDSR_b.XTALSTDF, 0UL);
    }
}

/**
 * @brief  Get the XTAL error flag.
 * @param  None
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetXtalStdStatus(void)
{
    return ((0UL != READ_REG32(bM4_CMU->XTALSTDSR_b.XTALSTDF)) ? Set : Reset);
}

/**
 * @brief  Set HRC trimming value.
 * @param  [in] i8TrimVal specifies the trimming value for HRC.
 * @retval None
 */
void CLK_HrcTrim(int8_t i8TrimVal)
{
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG8(M4_CMU->HRCTRM, i8TrimVal);
}

/**
 * @brief  Set MRC trimming value.
 * @param  [in] i8TrimVal specifies the trimming value for MRC.
 * @retval None
 */
void CLK_MrcTrim(int8_t i8TrimVal)
{
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG8(M4_CMU->MRCTRM, i8TrimVal);
}

/**
 * @brief  Set LRC trimming value.
 * @param  [in] i8TrimVal specifies the trimming value for LRC.
 * @retval None
 */
void CLK_LrcTrim(int8_t i8TrimVal)
{
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG8(M4_CMU->LRCTRM, i8TrimVal);
}

/**
 * @brief  Set RTC LRC trimming value.
 * @param  [in] i8TrimVal specifies the trimming value for RTC LRC.
 * @retval None
 */
void CLK_RtcLrcTrim(int8_t i8TrimVal)
{
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG8(M4_CMU->RTCLRCTRM, i8TrimVal);
}

/**
 * @brief  PLL/XTAL/HRC stable flag read.
 * @param  [in] u8StableFlag specifies the stable flag to be read.
 *   @arg  CLK_STB_FLAG_HRCSTB
 *   @arg  CLK_STB_FLAG_XTALSTB
 *   @arg  CLK_STB_FLAG_PLLASTB
 *   @arg  CLK_STB_FLAG_PLLHSTB
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetStableStatus(uint8_t u8StableFlag)
{
    DDL_ASSERT(IS_CLK_STB_FLAG(u8StableFlag));

