RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
        pllap = (uint32_t)((M4_CMU->PLLACFGR >> CMU_PLLHCFGR_PLLHP_POS) & 0x0FUL);
        pllaq = (uint32_t)((M4_CMU->PLLACFGR >> CMU_PLLHCFGR_PLLHQ_POS) & 0x0FUL);
        pllar = (uint32_t)((M4_CMU->PLLACFGR >> CMU_PLLHCFGR_PLLHR_POS) & 0x0FUL);
        pllan = (uint32_t)((M4_CMU->PLLACFGR >> CMU_PLLHCFGR_PLLHN_POS) & 0x1FFUL);
        pllam = (uint32_t)((M4_CMU->PLLACFGR >> CMU_PLLHCFGR_PLLHM_POS) & 0x1FUL);

        /* PLLHP is used as system clock. */
        if (CLK_PLLSRC_XTAL == READ_REG32_BIT(M4_CMU->PLLHCFGR, CMU_PLLHCFGR_PLLSRC))
        {
            pllin = XTAL_VALUE;
        }
        else
        {
            pllin = HRC_VALUE;
        }
        pstcPllClkFreq->pllhvcin = (pllin/(pllhm + 1UL));
        pstcPllClkFreq->pllhvco = ((pllin/(pllhm + 1UL))*(pllhn + 1UL));
        pstcPllClkFreq->pllhp = ((pllin/(pllhm + 1UL))*(pllhn + 1UL))/(pllhp + 1UL);
        pstcPllClkFreq->pllhq = ((pllin/(pllhm + 1UL))*(pllhn + 1UL))/(pllhq + 1UL);
        pstcPllClkFreq->pllhr = ((pllin/(pllhm + 1UL))*(pllhn + 1UL))/(pllhr + 1UL);

        pstcPllClkFreq->pllavcin = (pllin/(pllam + 1UL));
        pstcPllClkFreq->pllavco = ((pllin/(pllam + 1UL))*(pllan + 1UL));
        pstcPllClkFreq->pllap = ((pllin/(pllam + 1UL))*(pllan + 1UL))/(pllap + 1UL);
        pstcPllClkFreq->pllaq = ((pllin/(pllam + 1UL))*(pllan + 1UL))/(pllaq + 1UL);
        pstcPllClkFreq->pllar = ((pllin/(pllam + 1UL))*(pllan + 1UL))/(pllar + 1UL);
    }
    return enRet;
}

/**
 * @brief  HCLK/PCLK divide setting.
 * @param  [in] u8ClkCate specifies the clock to be divided.
 *   @arg  CLK_CATE_PCLK0: Select PCLK0 to be divided
 *   @arg  CLK_CATE_PCLK1: Select PCLK1 to be divided
 *   @arg  CLK_CATE_PCLK2: Select PCLK2 to be divided
 *   @arg  CLK_CATE_PCLK3: Select PCLK3 to be divided
 *   @arg  CLK_CATE_PCLK4: Select PCLK4 to be divided
 *   @arg  CLK_CATE_EXCLK: Select EXCLK to be divided
 *   @arg  CLK_CATE_HCLK : Select HCLK  to be divided
 *   @arg  CLK_CATE_ALL : Select all to be divided
 * @param  [in] u32Div specifies the clock divide factor.
 *   @arg  CLK_HCLK_DIV1 : HCLK no divide
 *   @arg  CLK_HCLK_DIV2 : HCLK divided by 2
 *   @arg  CLK_HCLK_DIV4 : HCLK divided by 4
 *   @arg  CLK_HCLK_DIV8 : HCLK divided by 8
 *   @arg  CLK_HCLK_DIV16: HCLK divided by 16
 *   @arg  CLK_HCLK_DIV32: HCLK divided by 32
 *   @arg  CLK_HCLK_DIV64: HCLK divided by 64
 *   @arg  CLK_EXCLK_DIV1 : EXCLK no divide
 *   @arg  CLK_EXCLK_DIV2 : EXCLK divided by 2
 *   @arg  CLK_EXCLK_DIV4 : EXCLK divided by 4
 *   @arg  CLK_EXCLK_DIV8 : EXCLK divided by 8
 *   @arg  CLK_EXCLK_DIV16: EXCLK divided by 16
 *   @arg  CLK_EXCLK_DIV32: EXCLK divided by 32
 *   @arg  CLK_EXCLK_DIV64: EXCLK divided by 64
 *   @arg  CLK_PCLKx_DIV1 : PCLKx no divide
 *   @arg  CLK_PCLKx_DIV2 : PCLKx divided by 2
 *   @arg  CLK_PCLKx_DIV4 : PCLKx divided by 4
 *   @arg  CLK_PCLKx_DIV8 : PCLKx divided by 8
 *   @arg  CLK_PCLKx_DIV16: PCLKx divided by 16
 *   @arg  CLK_PCLKx_DIV32: PCLKx divided by 32
 *   @arg  CLK_PCLKx_DIV64: PCLKx divided by 64
 * @retval None
 * @note   'x' is 0~4 in CLK_PCLKx_DIVy
 */
void CLK_ClkDiv(uint8_t u8ClkCate, uint32_t u32Div)
{
    __IO uint32_t timeout = 0UL;
    /* backup FCGx setting */
    __IO uint32_t fcg0 = M4_PWC->FCG0;
    __IO uint32_t fcg1 = M4_PWC->FCG1;
    __IO uint32_t fcg2 = M4_PWC->FCG2;
    __IO uint32_t fcg3 = M4_PWC->FCG3;
    uint8_t u8TmpFlag = 0U;

    DDL_ASSERT(IS_CLK_HCLK_DIV(u32Div & CMU_SCFGR_HCLKS));
    DDL_ASSERT(IS_CLK_EXCLK_DIV(u32Div & CMU_SCFGR_EXCKS));
    DDL_ASSERT(IS_CLK_PCLK0_DIV(u32Div & CMU_SCFGR_PCLK0S));
    DDL_ASSERT(IS_CLK_PCLK1_DIV(u32Div & CMU_SCFGR_PCLK1S));
    DDL_ASSERT(IS_CLK_PCLK2_DIV(u32Div & CMU_SCFGR_PCLK2S));
    DDL_ASSERT(IS_CLK_PCLK3_DIV(u32Div & CMU_SCFGR_PCLK3S));
    DDL_ASSERT(IS_CLK_PCLK4_DIV(u32Div & CMU_SCFGR_PCLK4S));
    DDL_ASSERT(IS_CLK_CATE(u8ClkCate));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    /* Only current system clock source or target system clock source is PLLH
    need to close fcg0~fcg3 and open fcg0~fcg3 during switch system clock source.
    We need to backup fcg0~fcg3 before close them. */
    if (CLK_SYSCLKSOURCE_PLLH == READ_REG8_BIT(M4_CMU->CKSWR, CMU_CKSWR_CKSW))
    {
        DDL_ASSERT((M4_PWC->FCG0PC & PWC_FCG0PC_PRT0) == PWC_FCG0PC_PRT0);

        u8TmpFlag = 1U;

        /* Close FCGx. */
        M4_PWC->FCG0 = CLK_FCG0_DEFAULT;
        M4_PWC->FCG1 = CLK_FCG1_DEFAULT;
        M4_PWC->FCG2 = CLK_FCG2_DEFAULT;
        M4_PWC->FCG3 = CLK_FCG3_DEFAULT;

        /* Wait stable after close FCGx. */
        do
        {
            timeout++;
        } while(timeout < CLK_SYSCLK_SW_STABLE);
    }

    /* PCLK0 div */
    if (0U != (CLK_CATE_PCLK0 & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_PCLK0S, u32Div);
    }
    /* PCLK1 div */
    if (0U != (CLK_CATE_PCLK1 & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S, u32Div);
    }
    /* PCLK2 div */
    if (0U != (CLK_CATE_PCLK2 & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_PCLK2S, u32Div);
    }
    /* PCLK3 div */
    if (0U != (CLK_CATE_PCLK3 & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_PCLK3S, u32Div);
    }
    /* PCLK4 div */
    if (0U != (CLK_CATE_PCLK4 & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_PCLK4S, u32Div);
    }
    /* Ext. bus clock div */
    if (0U != (CLK_CATE_EXCLK & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_EXCKS, u32Div);
    }
    /* HCLK div */
    if (0U != (CLK_CATE_HCLK & u8ClkCate))
    {
        MODIFY_REG32(M4_CMU->SCFGR, CMU_SCFGR_HCLKS, u32Div);
    }
    if (1U == u8TmpFlag)
    {
        M4_PWC->FCG0 = fcg0;
        M4_PWC->FCG1 = fcg1;
        M4_PWC->FCG2 = fcg2;
        M4_PWC->FCG3 = fcg3;

        /* Wait stable after open fcg. */
        timeout = 0UL;
        do
        {
            timeout++;
        } while(timeout < CLK_SYSCLK_SW_STABLE);
    }
}

/**
 * @brief  USB clock source config.
 * @param  [in] u8UsbClk specifies the USB clock source.
 *   @arg  CLK_USB_CLK_MCLK_DIV2:  Select PCLK1 divide by 2 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV3:  Select PCLK1 divide by 3 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV4:  Select PCLK1 divide by 4 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV5:  Select PCLK1 divide by 5 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV6:  Select PCLK1 divide by 6 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV7:  Select PCLK1 divide by 7 as USB clock
 *   @arg  CLK_USB_CLK_MCLK_DIV8:  Select PCLK1 divide by 8 as USB clock
 *   @arg  CLK_USB_CLK_PLLHQ: Select PLLHQ as USB clock
 *   @arg  CLK_USB_CLK_PLLHR: Select PLLHR as USB clock
 *   @arg  CLK_USB_CLK_PLLAP: Select PLLAP as USB clock
 *   @arg  CLK_USB_CLK_PLLAQ: Select PLLAQ as USB clock
 *   @arg  CLK_USB_CLK_PLLAR: Select PLLAR as USB clock
 * @retval None
 */
void CLK_USB_ClkConfig(uint8_t u8UsbClk)
{
    DDL_ASSERT(IS_CLK_USB_CLK(u8UsbClk));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG8(M4_CMU->USBCKCFGR, u8UsbClk);
}

/**
 * @brief  CAN clock source config.
 * @param  [in] u8CanCh specifies the CAN channel for clock source.
 *   @arg  CLK_CAN_CH1:  CAN Channel 1
 *   @arg  CLK_CAN_CH2:  CAN Channel 2
 * @param  [in] u8CanClk specifies the CAN clock source.
 *   @arg  CLK_CAN1_CLK_MCLK_DIV2:  Select system clock divide by 2 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV3:  Select system clock divide by 3 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV4:  Select system clock divide by 4 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV5:  Select system clock divide by 5 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV6:  Select system clock divide by 6 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV7:  Select system clock divide by 7 as CAN clock
 *   @arg  CLK_CAN1_CLK_MCLK_DIV8:  Select system clock divide by 8 as CAN clock
 *   @arg  CLK_CAN1_CLK_PLLHQ: Select PLLHQ as CAN clock
 *   @arg  CLK_CAN1_CLK_PLLHR: Select PLLHR as CAN clock
 *   @arg  CLK_CAN1_CLK_PLLAP: Select PLLAP as CAN clock
 *   @arg  CLK_CAN1_CLK_PLLAQ: Select PLLAQ as CAN clock
 *   @arg  CLK_CAN1_CLK_PLLAR: Select PLLAR as CAN clock
 *   @arg  CLK_CAN_CLK_XTAL: Select PLLAR as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV2:  Select system clock divide by 2 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV3:  Select system clock divide by 3 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV4:  Select system clock divide by 4 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV5:  Select system clock divide by 5 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV6:  Select system clock divide by 6 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV7:  Select system clock divide by 7 as CAN clock
 *   @arg  CLK_CAN2_CLK_MCLK_DIV8:  Select system clock divide by 8 as CAN clock
 *   @arg  CLK_CAN2_CLK_PLLHQ: Select PLLHQ as CAN clock
 *   @arg  CLK_CAN2_CLK_PLLHR: Select PLLHR as CAN clock
 *   @arg  CLK_CAN2_CLK_PLLAP: Select PLLAP as CAN clock
 *   @arg  CLK_CAN2_CLK_PLLAQ: Select PLLAQ as CAN clock
 *   @arg  CLK_CAN2_CLK_PLLAR: Select PLLAR as CAN clock
 *   @arg  CLK_CAN2_CLK_XTAL: Select PLLAR as CAN clock
 * @retval None
 */
void CLK_CAN_ClkConfig(uint8_t u8CanCh, uint8_t u8CanClk)
{
    DDL_ASSERT(IS_CLK_CAN_CH(u8CanCh));
    DDL_ASSERT(IS_CLK_CAN_CLK(u8CanClk));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    if (0U != (CLK_CAN_CH1 & u8CanCh))
    {
        MODIFY_REG8(M4_CMU->CANCKCFGR, CMU_CANCKCFGR_CAN1CKS, u8CanClk);
    }
    if (0U != (CLK_CAN_CH2 & u8CanCh))
    {
        MODIFY_REG8(M4_CMU->CANCKCFGR, CMU_CANCKCFGR_CAN2CKS, u8CanClk);
    }
}

/**
 * @brief  I2S clock source config.
 * @param  [in] u8I2sCh specifies the I2S channel for clock source.
 *   @arg  CLK_I2S_CH1:  I2S Channel 1
 *   @arg  CLK_I2S_CH2:  I2S Channel 2
 *   @arg  CLK_I2S_CH3:  I2S Channel 3
 *   @arg  CLK_I2S_CH4:  I2S Channel 4
 * @param  [in] u16I2sClk specifies the I2S clock source.
 *   @arg  CLK_I2S1_CLK_PCLK:  Select PCLK3 as I2S clock
 *   @arg  CLK_I2S1_CLK_PLLHQ: Select PLLHQ as I2S clock
 *   @arg  CLK_I2S1_CLK_PLLHR: Select PLLHR as I2S clock
 *   @arg  CLK_I2S1_CLK_PLLAP: Select PLLAP as I2S clock
 *   @arg  CLK_I2S1_CLK_PLLAQ: Select PLLAQ as I2S clock
 *   @arg  CLK_I2S1_CLK_PLLAR: Select PLLAR as I2S clock
 *   @arg  CLK_I2S2_CLK_PCLK:  Select PCLK3 as I2S clock
 *   @arg  CLK_I2S2_CLK_PLLHQ: Select PLLHQ as I2S clock
 *   @arg  CLK_I2S2_CLK_PLLHR: Select PLLHR as I2S clock
 *   @arg  CLK_I2S2_CLK_PLLAP: Select PLLAP as I2S clock
 *   @arg  CLK_I2S2_CLK_PLLAQ: Select PLLAQ as I2S clock
 *   @arg  CLK_I2S2_CLK_PLLAR: Select PLLAR as I2S clock
 *   @arg  CLK_I2S3_CLK_PCLK:  Select PCLK3 as I2S clock
 *   @arg  CLK_I2S3_CLK_PLLHQ: Select PLLHQ as I2S clock
 *   @arg  CLK_I2S3_CLK_PLLHR: Select PLLHR as I2S clock
 *   @arg  CLK_I2S3_CLK_PLLAP: Select PLLAP as I2S clock
 *   @arg  CLK_I2S3_CLK_PLLAQ: Select PLLAQ as I2S clock
 *   @arg  CLK_I2S3_CLK_PLLAR: Select PLLAR as I2S clock
 *   @arg  CLK_I2S4_CLK_PCLK:  Select PCLK3 as I2S clock
 *   @arg  CLK_I2S4_CLK_PLLHQ: Select PLLHQ as I2S clock
 *   @arg  CLK_I2S4_CLK_PLLHR: Select PLLHR as I2S clock
 *   @arg  CLK_I2S4_CLK_PLLAP: Select PLLAP as I2S clock
 *   @arg  CLK_I2S4_CLK_PLLAQ: Select PLLAQ as I2S clock
 *   @arg  CLK_I2S4_CLK_PLLAR: Select PLLAR as I2S clock
 * @retval None
 */
void CLK_I2S_ClkConfig(uint8_t u8I2sCh, uint16_t u16I2sClk)
{
    DDL_ASSERT(IS_CLK_I2S_CH(u8I2sCh));
    DDL_ASSERT(IS_CLK_I2S_CLK(u16I2sClk));
    DDL_ASSERT(IS_CLK_SEL_UNLOCKED());

    if (0U != (CLK_I2S_CH1 & u8I2sCh))
    {
        MODIFY_REG16(M4_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S1CKSEL, u16I2sClk);
    }
    if (0U != (CLK_I2S_CH2 & u8I2sCh))
    {
        MODIFY_REG16(M4_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S2CKSEL, u16I2sClk);
    }
    if (0U != (CLK_I2S_CH3 & u8I2sCh))
    {
        MODIFY_REG16(M4_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S3CKSEL, u16I2sClk);
    }
    if (0U != (CLK_I2S_CH4 & u8I2sCh))
    {
        MODIFY_REG16(M4_CMU->I2SCKSEL, CMU_I2SCKSEL_I2S4CKSEL, u16I2sClk);
    }
}

/**
 * @brief  ADC/DAC/TRNG clock source config.
 * @param  [in] u16Periclk specifies the ADC/DAC/TRNG clock source.
 *   @arg  CLK_PERI_CLK_PCLK:  Select default setting for PCLK2/PCLK4 clock
 *   @arg  CLK_PERI_CLK_PLLHQ: Select PLLHQ as PCLK2/PCLK4 clock
 *   @arg  CLK_PERI_CLK_PLLHR: Select PLLHR as PCLK2/PCLK4 clock
 *   @arg  CLK_PERI_CLK_PLLAP: Select PLLAP as PCLK2/PCLK4 clock
 *   @arg  CLK_PERI_CLK_PLLAQ: Select PLLAQ as PCLK2/PCLK4 clock
 *   @arg  CLK_PERI_CLK_PLLAR: Select PLLAR as PCLK2/PCLK4 clock
 * @retval None
 * @note   PCLK2 is used for ADC clock, PCLK4 is used for DAC/TRANG clock
 */
void CLK_PERI_ClkConfig(uint16_t u16Periclk)
{
    DDL_ASSERT(IS_CLK_PERI_CLK(u16Periclk));
    DDL_ASSERT(IS_CLK_SEL_UNLOCKED());

