RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_clk.c
    WRITE_REG16(M4_CMU->PERICKSEL, u16Periclk);
}

/**
 * @brief  Enable or disable the TPIU clock.
 * @param  [in] enNewState specifies the new state of the TPIU clock.
 *   @arg Enable:   Enable clock output.
 *   @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_TpiuClkCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    WRITE_REG32(bM4_CMU->TPIUCKCFGR_b.TPIUCKOE, enNewState);
}

/**
 * @brief  TPIU clock divider config.
 * @param  [in] u8TpiuDiv specifies the TPIU clock divide factor.
 *   @arg  CLK_TPIU_CLK_DIV1: TPIU clock no divide
 *   @arg  CLK_TPIU_CLK_DIV2: TPIU clock divide by 2
 *   @arg  CLK_TPIU_CLK_DIV4: TPIU clock divide by 4
 * @retval None
 */
void CLK_TpiuClkConfig(uint8_t u8TpiuDiv)
{
    DDL_ASSERT(IS_CLK_TPIU_CLK_DIV(u8TpiuDiv));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    MODIFY_REG8(M4_CMU->TPIUCKCFGR, CMU_TPIUCKCFGR_TPIUCKS, u8TpiuDiv);
}

/**
 * @brief  Selects the clock source to output on MCO1 pin.
 * @param  [in] CLK_MCOSource specifies the clock source to output.
 *   @arg CLK_MCOSOURCCE_HRC       HRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_MRC       MRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_LRC       LRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_XTAL      XTAL clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_XTAL32    XTAL32 clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLHP     PLLHP clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAP     PLLAP clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLHQ     PLLHQ clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAQ     PLLAQ clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAR     PLLAR clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_SYSCLK    System clock selected as MCOx source
 * @param  [in] CLK_MCODiv specifies the MCOx prescaler.
 *   @arg CLK_MCO_DIV1:   no division applied to MCOx clock
 *   @arg CLK_MCO_DIV2:   division by 2 applied to MCOx clock
 *   @arg CLK_MCO_DIV4:   division by 4 applied to MCOx clock
 *   @arg CLK_MCO_DIV8:   division by 8 applied to MCOx clock
 *   @arg CLK_MCO_DIV16:  division by 16 applied to MCOx clock
 *   @arg CLK_MCO_DIV32:  division by 32 applied to MCOx clock
 *   @arg CLK_MCO_DIV64:  division by 64 applied to MCOx clock
 *   @arg CLK_MCO_DIV128: division by 128 applied to MCOx clock
 * @retval None
 * @note   MCO pin should be configured in alternate function 1 mode.
 */
void CLK_MCO1Config(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv)
{
    /* Check the parameters. */
    DDL_ASSERT(IS_CLK_MCOSOURCE(CLK_MCOSource));
    DDL_ASSERT(IS_CLK_MCODIV(CLK_MCODiv));

    /* Enable register write. */
    DDL_ASSERT(IS_CLK_UNLOCKED());

    /* Config the MCO1 */
    MODIFY_REG8(M4_CMU->MCO1CFGR, (CMU_MCO1CFGR_MCO1SEL | CMU_MCO1CFGR_MCO1DIV), (CLK_MCODiv | CLK_MCOSource));
}

/**
 * @brief  Enable or disable the MCO1 output.
 * @param  [in] enNewState specifies the new state of the clock output.
 *   @arg Enable:   Enable clock output.
 *   @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_MCO1Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    /* Enable or disable clock output. */
    WRITE_REG32(bM4_CMU->MCO1CFGR_b.MCO1EN, enNewState);
}

/**
 * @brief  Selects the clock source to output on MCO2 pin.
 * @param  [in] CLK_MCOSource specifies the clock source to output.
 *   @arg CLK_MCOSOURCCE_HRC       HRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_MRC       MRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_LRC       LRC clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_XTAL      XTAL clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_XTAL32    XTAL32 clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLHP     PLLHP clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAP     PLLAP clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLHQ     PLLHQ clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAQ     PLLAQ clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_PLLAR     PLLAR clock selected as MCOx source
 *   @arg CLK_MCOSOURCCE_SYSCLK    System clock selected as MCOx source
 * @param  [in] CLK_MCODiv specifies the MCOx prescaler.
 *   @arg CLK_MCO_DIV1:   no division applied to MCOx clock
 *   @arg CLK_MCO_DIV2:   division by 2 applied to MCOx clock
 *   @arg CLK_MCO_DIV4:   division by 4 applied to MCOx clock
 *   @arg CLK_MCO_DIV8:   division by 8 applied to MCOx clock
 *   @arg CLK_MCO_DIV16:  division by 16 applied to MCOx clock
 *   @arg CLK_MCO_DIV32:  division by 32 applied to MCOx clock
 *   @arg CLK_MCO_DIV64:  division by 64 applied to MCOx clock
 *   @arg CLK_MCO_DIV128: division by 128 applied to MCOx clock
 * @retval None
 * @note   MCO2 pin should be configured in alternate function 1 mode.
 */
void CLK_MCO2Config(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv)
{
    /* Check the parameters. */
    DDL_ASSERT(IS_CLK_MCOSOURCE(CLK_MCOSource));
    DDL_ASSERT(IS_CLK_MCODIV(CLK_MCODiv));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    /* Config the MCO */
    MODIFY_REG8(M4_CMU->MCO2CFGR, (CMU_MCO2CFGR_MCO2SEL | CMU_MCO2CFGR_MCO2DIV), (CLK_MCODiv | CLK_MCOSource));
}

/**
 * @brief  Enable or disable the MCO2 output.
 * @param  [in] enNewState specifies the new state of the clock output.
 *   @arg Enable:   Enable clock output.
 *   @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_MCO2Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_CLK_UNLOCKED());

    /* Enable or disable clock output. */
    WRITE_REG32(bM4_CMU->MCO2CFGR_b.MCO2EN, enNewState);
}

/**
 * @}
 */

#endif /* DDL_CLK_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
